Tekla.Structures.Model.RebarCranking
The RebarCranking class represents the cranking of reinforcing bars at a Tekla.Structures.Model.RebarSplitter.

Tekla.Structures.Model.RebarCranking.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarCranking class.

Tekla.Structures.Model.RebarCranking.CrankSide
Gets or sets the crank side.

Tekla.Structures.Model.RebarCranking.CrankRotation
Gets or sets the crank rotation.

Tekla.Structures.Model.RebarCranking.CrankStraightLength
Gets or sets the crank straight length.

Tekla.Structures.Model.RebarCranking.CrankedLengthType
Gets or sets the cranked length type.

Tekla.Structures.Model.RebarCranking.CrankedRatio
Gets or sets the cranked ratio.

Tekla.Structures.Model.RebarCranking.CrankedDistance
Gets or sets the cranked distance.

Tekla.Structures.Model.RebarCranking.CrankedOffset
Gets or sets the cranked offset.

Tekla.Structures.Model.RebarCranking.CrankingType
Gets or sets the cranking type.

Tekla.Structures.Model.RebarCranking.ToStruct(Tekla.Structures.ModelInternal.dotRebarCranking_t@)
The to struct method.
dotCranking: The rebar cranking struct.

Tekla.Structures.Model.RebarCranking.FromStruct(Tekla.Structures.ModelInternal.dotRebarCranking_t@)
The from struct method.
dotCranking: The rebar cranking struct.